---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeRunType
source: html/2d05f4c7-4a12-ee04-e786-00d5030484c7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeRunType Property

"Run Type": Run Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeRunType { get; }
```